Revit 2027 API
Transform2D.OfVector Method
 Applies the transformation to the vector and returns the result.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV OfVector(
	UV vector
)
Public Function OfVector (
	vector As UV
) As UV
public:
UV^ OfVector(
	UV^ vector
)
member OfVector :
        vector : UV -> UV
Parameters
vector UV
 The vector to transform.
Return Value
UV
 The transformed vector.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Transformation of a vector is not affected by the translational part of the transformation.
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace